docs/integrations/soap-request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <Authentication xmlns="http://tempuri.org/">
      <Key></Key>
    </Authentication>
  </soap:Header>
  <soap:Body>
    <ConsultaAdvogado xmlns="http://tempuri.org/">
      <inscricao>183619</inscricao>
      <uf>MG</uf>
      <nome></nome>
    </ConsultaAdvogado>
  </soap:Body>
</soap:Envelope>
